<?php
//用户协议
class Agreement {

    public static function article() {
        $str="<p>本协议是您与前海税务服务平台（简称“服务平台”）之间就服务平台等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击“注册”按钮后，本协议即构成对双方有约束力的法律文件。</p><br />";
        $str.="<h4>第 1 条本服务平台服务条款的确认和接纳</h4>";
        $str.="<p>1.1. 本服务平台的各项电子服务的所有权和运作权归平台所有。用户同意所有注册协议条款并完成注册程序，才能成为本服务平台的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。<br />";
        $str.="1.2. 用户点击同意本协议的，即视为用户确认自己具有享受本服务平台服务、相应的权利能力和行为能力，能够独立承担法律责任。<br />";
        $str.="1.3. 服务平台保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</p><br />";
        $str.="<h4>第 2 条本服务平台服务</h4>";
        $str.="<p>2.1. 服务平台通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本服务平台规定的情况下，方有权使用本服务平台的相关服务。<br />";
        $str.="2.2. 用户必须自行准备如下设备和承担如下开支：<br />";
        $str.="（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；<br />";
        $str.="（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p><br />";
        $str.="<h4>第 3 条用户信息</h4>";
        $str.="<p>3.1. 用户应自行诚信向本服务平台提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且服务平台保留终止用户使用平台各项服务的权利。<br />";
        $str.="3.2. 用户注册成功后，将产生用户名和密码等账户信息，您可以根据本服务平台规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本服务平台并向公安机关报案。<br />";
        $str.="3.3. 用户同意，平台拥有通过邮件、短信电话等形式，向您告知信息的权利。<br />";
        $str.="3.4. 用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。<br /><br />";
        $str.="<h4>第 4 条用户依法言行义务</h4>";
        $str.="本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：<br />";
        $str.="（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；<br />";
        $str.="（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；<br />";
        $str.="（3）不得利用本服务平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；<br />";
        $str.="（4）不得干扰本服务平台的正常运转，不得侵入本服务平台及国家计算机信息系统；<br />";
        $str.="（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；<br />";
        $str.="（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；<br />";
        $str.="（7）不得教唆他人从事本条所禁止的行为；<br />";
        $str.="（8）不得利用在本服务平台注册的账户进行牟利性经营活动；<br />";
        $str.="（9）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应关注并遵守本服务平台不时公布或修改的各类合法规则规定。本服务平台保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本服务平台有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。<br /><br />";
        $str.="<h4>第 5 条所有权及知识产权条款</h4>";
        $str.="<p>5.1. 用户一旦接受本协议，即表明该用户主动将其在任何时间段在本服务平台发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给服务平台所有，用户同意服务平台有权就任何主体侵权而单独提起诉讼。<br />";
        $str.="5.2. 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在万帮云健康客户端上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。<br />";
        $str.="5.3. 用户同意并已充分了解本协议的条款，承诺不将已发表于本服务平台的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。<br />";
        $str.="5.4. 除法律另有强制性规定外，未经服务平台明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本服务平台的信息内容，否则，服务平台有权追究其法律责任。<br />";
        $str.="5.5. 本服务平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是服务平台或其内容提供者的财产，受中国和国际版权法的保护。</p><br />";
        $str.="<h4>第 6 条责任限制及不承诺担保</h4>";
        $str.="<p>除非另有明确的书面说明，本服务平台及其所包含的或以其它方式通过本服务平台提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，服务平台不对本服务平台的运营及其包含在本服务平台上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>";
        $str.="<p style='text-align:right;''>2020 年 5 月</p><br/><br/>";
        return $str;

    } 
   
}
